public class Program {

//    Напишите программу вывода всех четных чисел от 2 до 100 влючительно

    public static void main(String[] args) {
        int x = 2;
        while (x <= 100) {
            System.out.println(x);
            x = x + 2;
        }
    }
}